ubirch/ubirch-kinetis-sdk/SDK_2.1_MK82FN256xxx15/boards/twrk80f150m/demo_apps/emvl1/emvl1.c
        smartcard_context_t *drvCtx = (smartcard_context_t *)coreParams->x_context;

        uint8_t sw1 = drvCtx->statusBytes[0u];
        uint8_t sw2 = drvCtx->statusBytes[1u];
        /* Check status bytes, 0x6A 0x82 - File not found */
        if ((status == kSCCoreSuccess) && !(sw1 == 0x6A && sw2 == 0x82))
        {
            /* Match found. */
            switch (i)
            {
                case 0u:
                    return kCardMastercard;
                case 1u:
                    return kCardVisa;
                case 2u:
                    return kCardVisaElectron;
                case 3u:
                    return kCardAmex;
                case 4u:
                    return kCardEuropay;
                case 5u:
                    return kCardUnionPayDebit;
                case 6u:
                    return kCardUnionPayCredit;
            }
        }
    }
    /* No match. */
    return kCardUnsupported;
}

/*!
 * @brief Function sends EMV commands (Get processing options or read of specific record) to ICC.
 */
smartcard_core_error_t send_command(smartcard_core_params_t *coreParams,
                                    uint8_t p1,
                                    uint8_t p2,
                                    smartcard_tal_cmd_t *cmd,
                                    smartcard_tal_resp_t *resp,
                                    card_type_t type)
{
    /* Sending Get processing information */
    if ((0u == p1) && (0u == p2))
    {
        if (type == kCardUnsupported)
        {
            return kSCCoreInvalidInputParameter;
        }
        /* Union Pay cards require to send PDOL from terminal as command data (additional informative tag),
         * according AID file selection response. */
        if ((type == kCardUnionPayDebit) || (type == kCardUnionPayCredit))
        {
            cmd->apdu[0u] = 0x80u; /* Command class */
            cmd->apdu[1u] = 0xA8u; /* INS byte */
            cmd->apdu[2u] = 0x00u; /* P1 */
            cmd->apdu[3u] = 0x00u; /* P2 */
            cmd->apdu[4u] = 0x0Bu; /* Lc = 0x0B */
            /* Lc data */
            cmd->apdu[5u] =
                0x83u; /* Tag indicating requested PDOL objects parsed from AID selection file command response. */
            cmd->apdu[6u] = 0x09u; /* Length of PDOL data. (Data is send without tags.) */
            /* Hard-coded PDOL objects without objects tags. */
            /* VLP Terminal Support Indicator */
            cmd->apdu[7u] = 0x00u;
            /* Amount, Authorised (Numeric) */
            cmd->apdu[8u] = 0x00u;
            cmd->apdu[9u] = 0x00u;
            cmd->apdu[10u] = 0x00u;
            cmd->apdu[11u] = 0x00u;
            cmd->apdu[12u] = 0x01u;
            cmd->apdu[13u] = 0x00u;
            /* Transaction Currency code */
            cmd->apdu[14u] = 0x01u; /* China CNY */
            cmd->apdu[15u] = 0x56u; /* China CNY */
            cmd->apdu[16u] = 0u;    /* Le = 0 */
            cmd->length = 17u;
        }
        else
        { /* Most of MASTER and VISA cards doesn't require sending terminal PDOL tags.
           * Get processing options is send without PDOL tags.*/
            cmd->apdu[0u] = 0x80u;
            cmd->apdu[1u] = 0xA8u;
            cmd->apdu[2u] = 0x00u;
            cmd->apdu[3u] = 0x00u;
            cmd->apdu[4u] = 0x02u;
            cmd->apdu[5u] = 0x83u;
            cmd->apdu[6u] = 0x00u;
            cmd->apdu[7u] = 0x00u;
            cmd->length = 8u;
        }
    }
    else
    {                               /* Read record command to get specific data. */
        cmd->apdu[0u] = 0x00u;      /* Command class */
        cmd->apdu[1u] = 0xB2u;      /* INS - read record */
        cmd->apdu[2u] = p1;         /* P1 */
        cmd->apdu[3u] = p2 | 0x04u; /* P2 */
        cmd->apdu[4u] = 0x00u;      /* Lc = 0 */
        cmd->length = 5u;
    }
    return smartcard_tal_send_cmd(coreParams, cmd, resp);
}

/*!
 * @briefExtract AFL list from GET_PROCESSING_OPTIONS response.
 */
int extract_afl_list(uint8_t list[MAX_AFL][4], uint8_t *src)
{
    uint32_t i;
    uint32_t size = 0u;

    /* Format is tag '80' */
    if (src[0u] == 0x80u)
    {
        /* Subtract 2 from the size (the two bytes being ignored are the AIP. */
        size = src[1u] - 2u;
        if ((size / 4u) > MAX_AFL)
        {
            return 0u;
        }
        for (i = 0u; i < (size / 4u); i++)
        {
            list[i][0u] = src[4u + (i * 4u)];
            list[i][1u] = src[5u + (i * 4u)];
            list[i][2u] = src[6u + (i * 4u)];
            list[i][3u] = src[7u + (i * 4u)];
        }
    }
    /* Format is tag '77' */
    else if (src[0u] == 0x77u)
    {
        /* The size is embedded a bit deeper into the frame. */
        size = src[7u];
        if ((size / 4u) > MAX_AFL)
        {
            return 0u;
        }
        for (i = 0u; i < (size / 4u); i++)
        {
            list[i][0u] = src[8u + (i * 4u)];
            list[i][1u] = src[9u + (i * 4u)];
            list[i][2u] = src[10u + (i * 4u)];
            list[i][3u] = src[11u + (i * 4u)];
        }
    }
    return size / 4u;
}

/*!
 * @brief Parse a READ_RECORD response and extract card info.
 */
int extract_card_info(uint8_t *src)
{
    uint32_t i, itemStart, itemSize, itemNum;

    for (itemNum = 0u; itemNum < DESIRED_CARD_INFO_TAGS; itemNum++)
    {
        if (cardItem_found[itemNum])
        {
            continue;
        }
        /* Find the starting point of the searched item. */
        i = 0;
        itemSize = 0u;
        while (!((src[i] == 0x90u) && (src[i + 1u] == 0x00u)))
        {
            if ((src[i] == g_desiredTags[itemNum][0u]) &&
                ((g_desiredTags[itemNum][1u] == 0u) || (src[i + 1u] == g_desiredTags[itemNum][1u])))
            {
                if ((g_desiredTags[itemNum][0u] == 0x5A) && (src[i + 1u] > 10u))
                {
                    i++;
                    continue;
                }
                if (0u == g_desiredTags[itemNum][1u])
                {
                    itemStart = i + 2u;
                    itemSize = src[i + 1u];
                }
                else
                {
                    itemStart = i + 3u;
                    itemSize = src[i + 2u];
                }
                break;
            }
            i++;
        }
        /* Extract the data element body field.*/
        if (itemSize)
        {
            i = 0u;
            while (i < itemSize)
            {
                card_items[itemNum][i] = src[itemStart + i];
                if (itemNum == 0x02u && (src[itemStart + i] == 0x20u) && (src[itemStart + i + 1u] == 0x20u))
                { /* Terminate the string.*/
                    card_items[itemNum][i] = 0x00u;
                    break;
                }
                i++;
            }
            /* If we reached the end without having two spaces, terminate the string. */
            if (itemNum == 0x02u && i == itemSize)
            {
                card_items[itemNum][i] = 0x00u;
            }
            cardItem_found[itemNum] = true;
        }
    }
    for (itemNum = 0u; itemNum < DESIRED_CARD_INFO_TAGS; itemNum++)
    {
        if (!cardItem_found[itemNum])
        {
            return -1;
        }
    }
    return 0;
}

/*!
 * @brief Function checks error code of last smartcard transfer.
 */
static int8_t smartcard_tc_check_testresult(smartcard_core_params_t *coreParams)
{
    if (coreParams->errCode == kSCCoreSuccess)
    {
        PRINTF("TEST PASSED.\r\n");
    }
    else
    {
        PRINTF("TEST FAILED.\r\n");
    }
    PRINTF("Returned Status Bytes = 0x%2X, 0x%2X\r\n", ((smartcard_context_t *)coreParams->x_context)->statusBytes[0],
           ((smartcard_context_t *)coreParams->x_context)->statusBytes[1]);

