ubirch/ubirch-kinetis-sdk/SDK_2.1_MK82FN256xxx15/boards/twrk80f150m/demo_apps/emvl1/emvl1.c
    return (coreParams->errCode);
}

/*!
 * @brief T=0 protocol test using EMV Level 1 APIs.
 */
static bool smartcard_emvl1_t0_test(smartcard_core_params_t *coreParams)
{
    uint32_t i, j;
    smartcard_tal_cmd_t talCmd = {0};
    smartcard_tal_resp_t talResp = {0};
    card_type_t type;
    uint8_t aflList[MAX_AFL][4u];
    uint32_t aflListSize = 0u;
    uint8_t number = 0u;
    bool found = false;

    talResp.resp = rxBuff;
    talCmd.apdu = txBuff;
    PRINTF("==========================================\r\n");
    PRINTF("Protocol T=0 test started!\r\n");

    memset(rxBuff, 0, EMVL1_MAX_TRANSFER_SIZE);
    /* T=0 transport test */
    smartcard_setup_t0(coreParams);
    /* Search smartcard AID */
    type = scan_aid(coreParams, &talCmd, &talResp);
    if (kCardUnsupported == type)
    {
        return false;
    }
    memset(rxBuff, 0u, EMVL1_MAX_TRANSFER_SIZE);
    /* Obtain processing options to read card additional information from records */
    if (kSCCoreSuccess != send_command(coreParams, 0u, 0u, &talCmd, &talResp, type))
    {
        PRINTF("Obtaining processing options failed.\r\n");
        return false;
    }
    aflListSize = extract_afl_list(aflList, talResp.resp);
    if (0u == aflListSize)
    {
        PRINTF("Parsing received AFL list failed. \r\n");
        return false;
    }
    /* Read card records to get wanted card info */
    PRINTF("Reading card records to get required data. \r\n");
    /* 'i' is for the list of AFLs present. */
    for (i = 0u; i < aflListSize; i++)
    { /* 'j' is for the number of records in each AFL. */
        for (j = aflList[i][1u]; j <= aflList[i][2u]; j++)
        { /* Send READ_RECORD. */
            if (kSCCoreSuccess != send_command(coreParams, j, aflList[i][0u], &talCmd, &talResp, kCardUnsupported))
            { /* Give up and start a new iteration of the loop. */
                continue;
            }
            /* Parse read record for required data */
            if (0u == extract_card_info(talResp.resp))
            {
                found = true;
                break;
            }
        }
        /* Break when found. */
        if (found)
        {
            break;
        }
    }
    PRINTF("- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \r\n");
    PRINTF("Card info:\r\n");
    /* Check if PAN was found */
    if (cardItem_found[0])
    {
        PRINTF("          Primary account number: ");
        for (i = 0u; i < PRIMARY_ACCOUNT_NUMBER_LEN; i++)
        {
            if ((0x00u == card_items[0u][i]) && (0x00u == card_items[0u][i + 1u]))
            {
                break;
            }
            number = (uint8_t)(card_items[0u][i] >> 4u) + 0x30u;
            if (number > 0x39u)
            {
                break;
            }
            PRINTF("%c", number);
            number = (uint8_t)(card_items[0u][i] & 0xFu) + 0x30u;
            if (number > 0x39u)
            {
                break;
            }
            PRINTF("%c ", number);
        }
        PRINTF("\r\n");
    }
    /* Check if Application expiration date was found */
    if (cardItem_found[1u])
    {
        PRINTF("          Application expiration date: ");
        for (i = APP_EXP_DATE_LEN; i > 0u; i--)
        {
            if (0u == card_items[1][i - 1])
            {
                continue;
            }
            PRINTF("%c%c", (uint8_t)(card_items[1][i - 1] >> 4u) + 0x30u,
                   (uint8_t)(card_items[1u][i - 1] & 0x0Fu) + 0x30u);
            if (0u != (i - 1u))
            {
                PRINTF("/");
            }
        }
        PRINTF("\r\n");
    }
    /* Check if Cardholder name was found */
    if (cardItem_found[2u])
    {
        /* Check if cardholder name is valid */
        bool valid = false;
        for (i = 0; i < CARDHOLDER_NAME_LEN; i++)
        {
            if ((0x00u != card_items[2u][i]) || (0x20 != card_items[2u][i]))
            {
                valid = true;
            }
        }
        if (valid)
        {
            PRINTF("          Cardholder name: ");
            for (i = 0; i < CARDHOLDER_NAME_LEN; i++)
            {
                if (((0x20u == card_items[2u][i]) && (0x20u == card_items[2u][i + 1u])) || (0x00u == card_items[2u][i]))
                {
                    break;
                }
                PRINTF("%c", card_items[2u][i]);
            }
            PRINTF("\r\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \r\n");
        }
    }

    return true;
}

/*!
 * @brief T=1 protocol test using EMV Level 1 APIs
 */
static bool smartcard_emvl1_t1_test(smartcard_core_params_t *coreParams)
{
    int length;
    int i;
    int increment = 1;
    smartcard_tal_cmd_t talCmd;
    smartcard_tal_resp_t talResp;

    PRINTF("==========================================\r\n");
    PRINTF("Protocol T=1 test started!\r\n");

    /******************* Setup for T=0 transfer *******************/
    smartcard_setup_t0(coreParams);
    /* send a PPS indicating T=1 protocol */
    txBuff[0u] = 0xFFu;
    txBuff[1u] = 0x01u;
    txBuff[2u] = 0x00u;

    for (i = 0u; i < 2u; i++)
    {
        txBuff[2u] ^= txBuff[i];
    }

    memset(rxBuff, 0, EMVL1_MAX_TRANSFER_SIZE);
    smartcard_send_pps(coreParams, txBuff, rxBuff, 3);

    /* T=1 protocol test */
    length = 16u; /* payload */
    /* APDU */
    txBuff[0u] = 0xC0u;
    txBuff[1u] = 0x14u;     /* instruction code (0x14 for ECHO) */
    txBuff[2u] = increment; /* increment value - P1 */
    txBuff[3u] = 0u;        /* P2 */
    txBuff[4u] = length;    /* P3 = Lc */

    for (i = 0u; i < length; i++)
    {
        txBuff[i + 5u] = i;
    }

    /* last byte is the data length again */
    txBuff[length + 5u] = length;
    /******************* Setup for T=1 transfer *******************/
    smartcard_setup_t1(coreParams);

    talResp.resp = rxBuff;
    talCmd.apdu = txBuff;
    talCmd.length = (4u + 1u + txBuff[4u] + 1u);
    talResp.length = 0u;
    smartcard_tal_send_cmd(coreParams, &talCmd, &talResp);

